export const FAQ_DATA: { q: string; a: { up: string; down: string } }[] = [
	{
		a: {
			up: 'Да, имеется.',
			down: 'Доставка осуществляется всеми доступными логистическими компаниями.',
		},
		q: 'Имеется ли доставка?',
	},
	{
		a: {
			up: 'Да, имеется.',
			down: 'Партнерская скидка предоставляется гибкими условиями, которые определяются индивидуально.',
		},
		q: 'Имеется ли партнерская скидка?',
	},
	{
		a: {
			up: 'Индивидуально.',
			down: 'Минимальное количество удлинителей для заказа, составляет от одного удлинителя.',
		},
		q: 'Какое количество удлинителей необходимо для приобретения?',
	},
	{
        a: {
			up: 'Индивидуально.',
			down: 'Минимальное количество дней для осуществления заказа, составляет от одного дня.\n Благодаря складским программам, имеется отгрузка заказа в день обращения.',
		},
		q: 'Какое количество дней необходимо для изготовления?',
	},
];
