export const NUACES_DATA: { q: { m: string; d: string }; a: { up: string; down: string } }[] = [
	{
		a: {
			up: 'Главная причина, это надежная защита удлинителя от перегрева кабеля.',
			down: ' Если к удлинителю подключена нагрузка свыше 50% от мощности, кабель нагревается. <br /> Если кабель полностью размотан, то тепло рассеивается в среде. <br /> Если же кабель не размотан полностью, то следовательно, дополнительно изнашивается, что может привести к «ситуациям».',
		},
		q: {
			d: 'Причина использования удлинителя с размотанным кабелем',
			m: `Использование удлинителя 
			с размотанным кабелем`,
		},
	},
	{
		a: {
			up: ' Главная причина, это безопасная и продолжительная служба удлинителя.',
			down: ' Поэтому важно заранее определить перечень оборудования, которые собираетесь использовать с помощью удлинителя, <br />а также, посчитать суммарно их мощность, которая не должна превышать мощность удлинителя. <br /> Предел мощности удлинителя можно определить по максимальному току нагрузки.',
		},
		q: {
			d: 'Причина использования удлинителя с определенным оборудованием',
			m: `Использование удлинителя 
			с определенным оборудованием`,
		},
	},
	{
		a: {
			up: '«IP20», это стандартный уровень защиты в удлинителях, определен только безопасным корпусом.',
			down: '«IP44», это повышенный уровень защиты в удлинителях, определен защитными крышками в розетках удлинителя.',
		},
		q: {
			d: 'Разница степени защиты «IP20» и «IP44», применимая на удлинителях, производимые компанией «ТОРЭЛЕКТРО»',
			m: ' Разница защиты «IP20» и «IP44», применимая на удлинителях',
		},
	},
	{
		a: {
			up: ' Розетки обычно определены на силы тока «10А» и «16А», следовательно, чем выше показатель, тем больше возможностей использования оборудования с «настоящим источником тока».',
			down: 'Приблизительно суммарная мощность подключенного оборудования при «10А» не более 2.2 кВт, при «16А» не более 3.5 кВт.',
		},
		q: {
			d: 'Разница сила тока «10А» и «16А», применимая на удлинителях, производимые компанией «ТОРЭЛЕКТРО»',
			m: 'Разница сила тока «10А» и «16А», применимая на удлинителях',
		},
	},
];
